#include <iostream>
#include<vector>
#include<algorithm>

using namespace std;

// Пример3.У исполнителя Утроитель две команды, которым присвоены номера :
// 1. прибавь 2
// 2. умножь на 3
// Первая из них увеличивает число на экране на 2, вторая — утраивает его.
// Программа для Утроителя — это последовательность команд.Сколько есть
// программ, которые число 2 преобразуют в число 20 ?
// 5 6 3 4 7 2 8

/*
d20 = d18 = 5
d18 = d16 + d6 = 5
d16 = d14 = 3
d14 = d12 = 3
d12 = d10 + d4 = 3
d10 = d8 = 2
d8 = d6 = 2
d6 = d4 + d2 = 2
d4 = d2 = 1
d2 = 1
*/

int main()
{
	// Обратный обход
	vector<int> dp(21);
	dp[2] = 1;
	for (int i = 2; i <= 18; i += 2)
	{
		dp[i + 2] += dp[i];
		if (i * 3 <= 20)
			dp[i * 3] += dp[i];
	}
	cout << dp[20] << endl;

	// Прямой обход
	vector<int> dp2(21);
	dp2[2] = 1;
	for (int i = 4; i <= 20; i += 2)
	{
		dp2[i] = dp2[i - 2];
		if (i % 3 == 0)
			dp2[i] += dp2[i / 3];
	}
	cout << dp2[20] << endl;
}
